app/views/subjects/index.html.erb

		  		<td><%= status_tag(subject.visible)%></td>
		  		<td><%=subject.page.length %></td>
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`subject_id` = 6