app/views/subjects/new.html.erb

INSERT INTO `subjects` (`name`, `position`, `created_at`, `updated_at`) VALUES ('beeran', 67, '2020-08-30 17:28:12.922480', '2020-08-30 17:28:12.922480')
---
<div>
<%= link_to("<<<Back",subjects_path)%>