app/controllers/admin_users_controller.rb

SELECT COUNT(*) FROM `admin_users`
SELECT `admin_users`.* FROM `admin_users` ORDER BY created_at asc LIMIT 4 OFFSET 0
---
   def index
    @admins = AdminUser.paginate(page: params[:page], per_page: 4).order("created_at asc")

INSERT INTO `admin_users` (`first_name`, `last_name`, `email`, `username`, `created_at`, `updated_at`, `password_digest`) VALUES ('Rahul', 'Menon', 'c.nibi123@gmail.com', 'RMenon', '2020-09-02 16:37:57.993408', '2020-09-02 16:37:57.993408', '$2a$12$rdudkwGpY5CqBCeE.7Jl4u3Ch3E9HdOOrojnuPbxWBK4v5KdFsrky')
---
  def create
    @admins = AdminUser.new(admins_params)
    if(@admins.save)

SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 3 LIMIT 1
---
  def edit
    @admin = AdminUser.find(params[:id])

SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1
UPDATE `admin_users` SET `admin_users`.`first_name` = 'Nbin1', `admin_users`.`password_digest` = '$2a$12$Q5mhBDqk/9PKHVKPbohLUu/UjqdB.q/wu1mlpHNavT/v0xineQ2Ii', `admin_users`.`updated_at` = '2020-09-01 16:44:39.805581' WHERE `admin_users`.`id` = 1
---
  def update
    @admin = AdminUser.find(params[:id])
    if(@admin.update_attributes(admins_params))

SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 6 LIMIT 1
---
  def delete
    @admin = AdminUser.find(params[:id])

SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 6 LIMIT 1
DELETE FROM `admin_users` WHERE `admin_users`.`id` = 6
---
  def destroy

    @admin = AdminUser.find(params[:id])
    if @admin
      flash[:notice]="admin user #{@admin.username} deleted"
      @admin.destroy