app/controllers/pages_controller.rb

SELECT COUNT(*) FROM `pages` WHERE `pages`.`subject_id` = 3
SELECT `pages`.* FROM `pages` WHERE `pages`.`subject_id` = 2 ORDER BY position asc LIMIT 4 OFFSET 0
---
  def index
    @pages = @subject.page.order("position asc")

INSERT INTO `pages` (`subject_id`, `name`, `permalink`, `position`, `visible`, `created_at`, `updated_at`) VALUES (3, 'Ray', 5, 67, FALSE, '2020-09-01 17:15:28.918872', '2020-09-01 17:15:28.918872')
---
  def create
    @page = Page.new(pages_params)
    if(@page.save)

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1
UPDATE `pages` SET `pages`.`subject_id` = 6, `pages`.`name` = 'Jai Hind', `pages`.`visible` = FALSE, `pages`.`updated_at` = '2020-09-01 17:10:22.915102' WHERE `pages`.`id` = 1
---
  def update
    @page = Page.find(params[:id])
    if(@page.update_attributes(pages_params))

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 3 LIMIT 1
DELETE FROM `pages` WHERE `pages`.`id` = 3
---
  def destroy
    @page = Page.find(params[:id])
    if(@page)
      @page.destroy

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 6 LIMIT 1
---
  def find_subject
    @subject = Subject.find(params[:subject_id])