app/controllers/subjects_controller.rb

SELECT COUNT(*) FROM `subjects`
SELECT `pages`.* FROM `pages` WHERE `pages`.`subject_id` = 1
SELECT `subjects`.* FROM `subjects` ORDER BY position, asc
---
  def index
   # @subjects = Subject.all.order("position asc")
   @subjects = Subject.paginate(page: params[:page], per_page: 4)

INSERT INTO `subjects` (`name`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('First Subject', 56, FALSE, '2020-09-03 00:21:15.512754', '2020-09-03 00:21:15.512754')
---
  def create
    @subjects = Subject.new(subjects_params)

    if @subjects.save

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 6 LIMIT 1
UPDATE `subjects` SET `subjects`.`visible` = FALSE, `subjects`.`updated_at` = '2020-09-02 15:57:24.858123' WHERE `subjects`.`id` = 6
---
  def update
    @subject = Subject.find(params[:id])

     if(@subject.update_attributes(subjects_params))

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 12 LIMIT 1
DELETE FROM `subjects` WHERE `subjects`.`id` = 12
---
  def destroy
     @subject = Subject.find(params[:id])
    if @subject
      @subject.destroy